EDT/ZUP/zup_edt/src/Documents/ЗаключениеМедицинскогоОсмотра/ЗаключениеМедицинскогоОсмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаключениеМедицинскогоОсмотра</name>
  <basedOn>Document.НаправлениеНаМедицинскийОсмотр</basedOn>
  <registerRecords>InformationRegister.МедицинскиеОсмотры</registerRecords>
  <registerRecords>InformationRegister.МедицинскиеОсмотрыПоВидамРабот</registerRecords>
  <registerRecords>InformationRegister.МедицинскиеОсмотрыПоВреднымФакторам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>DocumentRef.НаправлениеНаМедицинскийОсмотр</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОсмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОсмотра</name>
    <type>
      <types>EnumRef.ТипыМедицинскогоОсмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатОсмотра</name>
    <type>
      <types>EnumRef.РезультатыМедицинскогоОсмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>ПояснениеРезультата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВредныеФакторы</name>
    <attributes>
      <name>ВредныйФактор</name>
      <type>
        <types>CatalogRef.ВредныеОпасныеПроизводственныеФакторы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыРабот</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРаботМедицинскихОсмотров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/InformationRegisters/ОтстранениеОтРаботыПоРезультатамМедицинскогоОсмотра/ОтстранениеОтРаботыПоРезультатамМедицинскогоОсмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтстранениеОтРаботыПоРезультатамМедицинскогоОсмотра</name>
  <resources>
    <name>ЗаключениеМедицинскогоОсмотра</name>
    <type>
      <types>DocumentRef.ЗаключениеМедицинскогоОсмотра</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументОтстранения</name>
    <type>
      <types>DocumentRef.КадровыйПеревод</types>
      <types>DocumentRef.Увольнение</types>
      <types>DocumentRef.РешениеОКадровомПереводе</types>
      <types>DocumentRef.РешениеОбУвольнении</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/Documents/ЗаключениеМедицинскогоОсмотра/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МедицинскиеОсмотрыКлиентСервер.ЗаполнитьПредставлениеДокумента(Данные, Представление, НСтр("ru = 'Заключение'"));
	
КонецПроцедуры
	
#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
//
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаФизическоеЛицоВШапке("ФизическоеЛицо", "");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеДляЗаполнения() Экспорт
	
	Описание = Новый Структура(
		"Организация,
		|Направление,
		|ДатаОсмотра,
		|РезультатОсмотра,
		|ПояснениеРезультата");
	
	Возврат Описание;
	
КонецФункции

Функция ДанныеЗаключения(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заключение.Ссылка КАК Ссылка,
		|	Заключение.Номер КАК Номер,
		|	Заключение.Дата КАК Дата,
		|	Заключение.Проведен КАК Проведен,
		|	Заключение.Организация КАК Организация,
		|	Заключение.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Заключение.Позиция КАК Позиция,
		|	Заключение.Направление КАК Направление,
		|	Заключение.ДатаОсмотра КАК ДатаОсмотра,
		|	Заключение.ТипОсмотра КАК ТипОсмотра,
		|	Заключение.РезультатОсмотра КАК РезультатОсмотра,
		|	Заключение.ПояснениеРезультата КАК ПояснениеРезультата,
		|	Заключение.Ответственный КАК Ответственный,
		|	Заключение.Комментарий КАК Комментарий,
		|	ОтстранениеОтРаботы.ДокументОтстранения КАК ДокументОтстранения
		|ИЗ
		|	Документ.ЗаключениеМедицинскогоОсмотра КАК Заключение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтстранениеОтРаботыПоРезультатамМедицинскогоОсмотра КАК ОтстранениеОтРаботы
		|		ПО (ОтстранениеОтРаботы.ЗаключениеМедицинскогоОсмотра = Заключение.Ссылка)
		|ГДЕ
		|	Заключение.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
КонецФункции

#КонецОбласти

#КонецЕсли
